{
   "annotation":"Submitted to UN’s Commission on the Limits of the Continental Shelf on the 12 November 2008.</br>The claim includes an area of 439,979.24km2",
   "state":"Japans claim in regard of the Continental Shelf",
   "img":"./img/claims/13.png",
   "children":[
      {
         "annotation":"coming from the States Korea & China",
         "state":"Diplomatic Notes against Japan’s Claim",
         "img":"./img/claims/again.png",
         "children":[
            {
               "state":" Korea, February 2009",
               "annotation":"The Permanent Mission of the Republic of Korea has further the honour to make a comment regarding the data in the executive summary provided by Japan, in accordance with Annex Ill, section IL2 (a) (v) of the Rules of Procedure of the Commission, which permits the State Parties to the United Nations Convention on the Law of the Sea (hereinafter referred to as 'the Convention') and the Member States of the United Nations to make comments on the submission by a coastal state. Article 121, paragraph 3 of the Convention clearly states that 'rocks which cannot sustain human habitation or economic life of their own shall have no exclusive economic zone or continental shelf' In this regard, the Republic of Korea has consistently held the view that Oki-no-Tori Shima, considered as a rock under Article 121, paragraph 3 of the Convention, is not entitled to any continental shelf extending to or beyond 200 nautical miles from the baselines from which the breadth of the territorial sea is measured, as defined in Article 76 of the Convention. The Republic of Korea, furthermore, believes that the legal status of Oki-no-Tori Shima is not a scientific or technical matter involving the establishment of the outer limits of the continental shelf, but rather a matter concerning the interpretation and application of Article 121 of the Convention, which is beyond the purview of the Commission.",
               "img":"./img/claims/koreaa.png",
               "size":40000,
               "children":[
                  {
                     "state":" Korea, August 2011",
                     "annotation":"The Permanent Mission of the Republic of Korea has further the honour to remind the Commission of Korea's comments made in the above-mentioned Note Verbale. The Republic of Korea reiterates that Oki-no-Tori Shima is clearly a rock under Article 121, paragraph 3 of the United Nations Convention on the Law of the Sea (hereinafter referred to as 'the Convention'), and thus it is not entitled to any continental shelf extending to or beyond 200 nautical miles from the baselines from which the breadth of the territorial sea is measured. Therefore, the legal status of Oki-no-Tori Shima is not a scientific or technical matter involving the establishment of the outer limits of the continental shelf, but rather a matter concerning the interpretation and application of Article 121 of the Convention, which is beyond the purview of the Commission. In this regard, the Republic of Korea has the honour to draw attention to the Chairman's statement at the 23rd session of the Commission, which acknowledged that the Commission has no role on matters relating to the legal interpretation of Article 121 of the Convention and to the Commission's decision at its 24th session, which ruled that the Commission shall not take action on the part of the recommendations prepared by the Subcommission in relation to Oki-no-Tori Shima.",
                     "img":"./img/claims/koreaa.png",
                     "size":40000,
                     "children":[
                        {
                           "state":" Japan, August 2011",
                           "annotation":"Japan wishes to note, however, that the quotation in the aforementioned Note from the Republic of Korea regarding the Commission's decision at its 24th session omits the words, 'until the Commission decides to do so.' In this regard, Japan would like to draw the attention of the Commission to paragraph I of Rule 53 of the Rules of Procedure of the Commission, which provides that 'the Commission shall consider and approve or amend the recommendations prepared by the subcommission following their submission by the subcommission.' Japan considers that a situation in which the Commission takes no action on a part of recommendations prepared by the subcommission is not envisioned under the Rules of Procedure or in any other relevant document.",
                           "img":"./img/claims/japann.png",
                           "size":40000
                        }
                     ]
                  }
               ]
            },
            {
               "state":"China, February 2009",
               "annotation":"The Chinese Government has carefully studied the Executive Summary of Japan's Submission, and has noted, in particular, of 200-nautical-mile extension of its continental shelf measured fom the basepoint Oki-no-Tori Shima Island, as well as the three regions, namely SKB, MIT and KPR, of the continental shelf extended beyond 200 nautical miles from the Oki-no-Tori Shima Island. It is to be noted that the so-called Oki-no-Tori Shima Island is in fact a rock as referred to in Article 121(3) of the Convention. Therefore, the Chinese Government wishes to draw the attention of the members of the Commission, the States Parties to the Convention as well as the Members of the United Nations to the inconformity with the Convention with regard to the inclusion of the rock of Oki-no-Tori in .Japan's Submission. ",
               "img":"./img/claims/chinaa.png",
               "size":40000,
               "children":[
                  {
                     "state":"Japan, August 2009",
                     "annotation":"As the Rules of Procedure of the Commission contain no article or provision governing matters pertaining to the interpretation of articles of the Convention, the Commission is not entitled to consider interpretations of the Convention by an individual State Party. Thus there is no reason for the Commission to take account of the matter of interpretation offered by China in considering Japan's submission. If the Commission took the position of China into account and made a decision not to consider a certain portion of Japan's submission, that decision in itself could be regarded as the matter of an interpretation of the Convention, which is not within the mandate of the Commission. Japan therefore requests the Commission not to take into consideration the position of China, but rather to consider Japan's submission in accordance with its mandate as provided for in the Convention. ",
                     "img":"./img/claims/japann.png",
                     "size":40000,
                     "children":[
                        {
                           "state":"China, August 2011",
                           "annotation":"The Chinese Government consistently maintains that, the rock of Oki-no­Tori, on its natural conditions, obviously cannot sustain human habitation or economic life of its own. According to Article 121(3) of the United Nations Convention on the Law of the Sea(hereinafter referred to as 'the Convention'), the rock of Oki-no-Tori shall have no exclusive economic zone or continental shelf. After Japan made its Submission, a number of States, including China, have expressed serious concern on claiming outer continental shelf with a rock as basepoint. The Chinese Government has noted that the Commission had acknowledged, in the Statement by its Chairman concerning its 23rd session, that it had no role on matters relating to the legal interpretation of Article 121 of the Convention. At its 24th session, the Commission decided that it shall not take action on the part of the recommendations prepared by the Subcommission in relation to the rock of Oki-no-Tori, until the Commission decides to do so.",
                           "img":"./img/claims/chinaa.png",
                           "size":40000,
                           "children":[
                              {
                                 "state":"Japan, August 2011",
                                 "annotation":"Paragraph 5 (a) of Annex I to the Rules of Procedure of the Commission on the Limits of the Continental Shelf provides that the Commission shall not consider a submission 'in cases where a land or maritime dispute exists'. In the aforementioned matter, it is a fact that no State other than Japan claims sovereignty over the Oki-no-Tori Shima Island or possesses any maritime area nearby which might overlap with the areas generated from the coastline of the island. The island is geographically located far from China, on the other side of the Japanese archipelago. As regards Oki-no-Tori Shima Island, China is not a 'State with opposite or adjacent coasts' and therefore cannot have a 'dispute' over the island with Japan. Moreover, it should be noted that Palau and the United States, whose continental shelves could potentially overlap with that of Japan from Oki-no-Tori Shima Island, explicitly indicated in their Notes to the Secretariat of the United Nations, Palau's Note No. 029/PMUNS/09, dated 15 June 2009, and the Note of the United States dated 22 December 2008, that they would not object to the Commission's considering Japan's submission. In that light, there exists no land or maritime dispute with regard to Oki-no-Tori Shima Island, and Japan thus considers that the Commission will be fulfilling its mandate by considering and making recommendations concerning Japan's submission. ",
                                 "img":"./img/claims/japann.png",
                                 "size":40000
                              }
                           ]
                        }
                     ]
                  }
               ]
            },
            {
               "state":"Japan, August 2009",
               "annotation":"The positions of China and the Republic of Korea expressed in the above-mentioned Notes are related to a matter of the interpretation of Article 121 of the United Nations Convention on the Law of the Sea by an individual State Party. As the Rules of Procedure of the Commission, however, contain no article or provision governing matters pertaining to the interpretation of such article of the Convention by the Commission, the Commission is not expected to consider such interpretation of the Convention by an individual State Party in relation with submissions of other countries. Therefore, Japan requests the Commission not to take into consideration the positions of China and the Republic of Korea expressed in the above-mentioned Notes.",
               "img":"./img/claims/japann.png",
               "size":40000,
               "children":[
                  {
                     "state":" Japan, August 2012",
                     "annotation":"However, neither of these two States claims sovereignty over Oki-no-Tori-Shima lsland, located on the other side of the Japanese archipelago from them, or possesses any maritime area nearby which might overlap with the areas generated from the coastline of this island. They thus have no direct interest in the legal status of this island. That is to say, the matter they are raising cannot be considered as a 'land or maritime dispute' between Japan and these States under paragraph 5(a) of Annex I of the Rules of Procedure of the Commission. Rather, it should be considered as a reflection of their views as to the interpretation of a specific provision of the Convention. This is obvious from the fact that the People's Republic of China and the Republic of Korea themselves have chosen not to quote paragraph 5(a) of Annex I in their Notes Verbale. (…) While they avoid making a claim based on paragraph 5(a) of Annex I, those States are trying to give the Commission the incorrect impression that there exists some sort of dispute between Japan and those States and thus the Commission must refrain from making its Recommendations to Japan. As the Commission is already well aware, however, there is no legal basis for such argument, and accepting it would be a deviation from the Commission's Rules of Procedure. The neighbouring States which could rightfully be concerned about Japan's submission, as their continental shelves might potentially overlap with that of Japan extended from Oki-no-Tori-Shima Island, are the Republic of Palau and the United States of America. Japan would like to underscore that these relevant neighboring States have explicitly indicated through their Notes (ote No. 029/PMUNS/09 dated 15 June 2009 from Palau and the Note dated 22 December 2008 from the US) to the Secretariat of the United Nations that they have no objection to the Commission's considering Japan's submission and making its recommendations.",
                     "img":"./img/claims/japann.png",
                     "size":40000
                  }
               ]
            }
         ]
      },
      {
         "annotation":"coming from the States Palau & USA",
         "state":"Diplomatic Notes in Favor of Japan’s Claim",
         "img":"./img/claims/infavor.png",
         "children":[
            {
               "state":"USA, December 2008",
               "annotation":"(…) The United States has taken note of the potential overlap between two areas of continental shelf with respect to which information is being submitted by Japan (one extending beyond 200 nautical miles (nm) from Haha Shima and from Minami-Tori Shima and the other extending beyond 200 nm from Minami-Io To), and areas of continental shelf beyond 200 nm extending from Farallon de Pajaros in the Commonwealth of the Northern Mariana Islands. The United Nations Convention on the Law of the Sea, including its Annex II, and the Rules of Procedure of the Commission, in particular Annex 1 thereto, provide that the actions of the Commission shall not prejudice matters relating to delimitation of boundaries between States with opposite or adjacent coasts. [...] the Government of the United States confirms that it does not object to Japan's request that the Commission consider the documentation in its submission relating to the aforementioned areas and make its recommendation on the basis of this documentation, to the extent that such recommendations are without prejudice to the establishment of the outer limits of its continental shelf by the United States, or to any final delimitation of the continental shelf concluded subsequently in these areas between Japan and the United States.",
               "img":"./img/claims/usaa.png",
               "size":40000
            },
            {
               "state":"Palau, June 2009",
               "annotation":"(…) The Republic of Palau has taken note of the potential overlap between two areas of continental shelf with respect to which information has been submitted by Japan extending beyond 200 nautical miles (nm) from Okino Tori Island and areas of continental shelf beyond 200 nm extending from the northeastern portion of the Republic of Palau’s 200 nm Exclusive Economic Zone (EEZ). (…) With reference to the Executive Summary of Japan’s submission, the Government of the Republic of Palau confirms that it does not object to Japan’s request that the Commission consider the documentation in its submission relating to the aforementioned areas and make its recommendation on the basis of this and make its recommendation on the basis of this documentation, to the extent that such recommendations are without prejudice to the establishment of the outer limits of its continental shelf by the Republic of Palau, or to any final delimitation of the continental shelf concluded subsequently in the areas between Japan and the Republic of Palau.",
               "img":"./img/claims/palauu.png",
               "size":40000
            }
         ]
      }
   ]
}