

{  
    "entity_name": "Alphabet Inc", 
    "ticker": "GOOG",
    "period": "12_31_2017",
    "scale": 1000000,
    "shares": [
        {"component":["Shares Outstanding", 687286090]},
        {"component":["Basic EPS", 49.59]},
        {"component":["Diluted EPS", 49.16]},
        {"component":["Weighted Average Shares Outstanding", 0]},
        {"component":["Weighted Average Shares Oustanding, Diluted", 0]}
    ], 
    "balance_sheet": {
        "assets": {
            "current_assets":[
                {"component":["Cash and Cash Equivalents", 18498]},
                {"component":["Marketable Securities", 101177]},
                {"component":["Accounts Receivable, net of allowance", 25326]},
                {"component":["Income taxes receivable, net", 2166]},
                {"component":["Inventory", 999]},
                {"component":["Other Current Assets", 4412]}
            ], 
            "total_current_assets": 152578,
            "non_current_assets": [
                {"component":["Non-marketable Investments", 13078]},
                {"component":["Deferred Income Taxes", 721]},
                {"component":["Property and equipment, net", 73646]},
                {"component":["Operating lease assets", 10941]},
                {"component":["Intangible assets, net", 1979]},
                {"component":["Goodwill", 20624]},
                {"component":["Other non-current assets", 2342]} 
            ],
            "total_non_current_assets": 123331, 
            "total_assets": 275909
        },
        "liabilities": {
            "current_liabilities": [
                {"component":["Accounts Payable", 5561]},
                {"component":["Accrued compensation and benefits", 8495]},
                {"component":["Accrued expenses and other current liabilities", 23067]},
                {"component":["Accrued revenue share", 5916]},
                {"component":["Deferred revenue", 1908]},
                {"component":["Income taxes payable, net", 274]}
            ],
            "total_current_liabilities": 45221, 
            "non_current_liabilities": [
                {"component":["Long-term Debt", 4554]},
                {"component":["Deferred revenue, non-current", 358]},
                {"component":["Income taxes payable, non-current", 9885]},
                {"component":["Deferred income taxes", 1701]},
                {"component":["Operating lease liabilities", 10214]},
                {"component":["Other long term liabilities", 2534]}
            ], 
            "total_non_current_liabilities": 29246,
            "total_liabilities": 74467
        }, 
        "equity": {
            "stock": [
                {"component":["Common Stock", 50552]},
                {"component":["Accumulated Other Comprehensive Income (Loss)", -1232]},
                {"component":["Retained Earnings", 152122]}
            ],
            "preferred_stock": [],
            "minority_interest": null, 
            "total_equity": 201442
        }
    },
    "income_statement": {
        "revenue": [
            { "component": ["Google Properties", 77788] },
            { "component": ["Google Network Members", 17587] },
            { "component": ["Google Other Revenues", 14277] },
            { "component": ["Other Bets", 1203] }
        ],
        "total_revenue": 110855,
        "operating_expenses": [
            { "component": ["Cost of Revenues", 45583]},
            { "component": ["Research and Development", 16625]},
            { "component": ["Sales and Marketing", 12893]},
            { "component": ["General and Administrative", 6872]},
            { "component": ["European Commission Fines", 2736]}
        ],
        "total_operating_costs": -84709,
        "operating_income": 26146,
        "other_income_expense": [
            { "component": ["Interest Income", 1312] },
            { "component": ["interest Expense", -109] },
            { "component": ["Foreign currency exchange gain (loss), net", -121] },
            { "component": ["Loss on marketable securities, net", -80] },
            { "component": ["Loss on non-marketable investments, net", -114] },
            { "component": ["Other", 159] }
        ],
        "total_other_income_expense": 1047,
        "pretax_income": 27193,
        "total_tax_provision": -14531, 
        "net_income_attributable_noncontrolling_interest": null,
        "net_income": 12662,
        "net_income_post_minority_interest": null
    }, 
    "cash_flow_statement": {
        "operating_cash_flows": {
            "reconciliation_adjustments": [
                {"component":["Depreciation and impairment of property and equipment", 10856]},
                {"component":["Amortization and impairment of intangible assets", 925]},
                {"component":["Stock-based compensation expense", 10794]},
                {"component":["Deferred income taxes", 173]},
                {"component":["(Gain) loss on debt and equity securities", -2798]},
                {"component":["Other", -592]}
            ],
        "total_reconciliation_adjustments": 19358,
            "working_capital_changes": [
                {"component":["Accounts receivable", -4340]},
                {"component":["Income taxes, net", -3128]},
                {"component":["Other assets", -621]},
                {"component":["Accounts payable", 428]},
                {"component":["Accrued expenses and other liabilities", 7170]},
                {"component":["Accrued revenue share", 1273]},
                {"component":["Deferred revenue", 37]}
            ],
        "total_change_in_working_capital": 819,
        "total_operating_cash_flows": 5452,
        "investing_cash_flows": [
            {"component":["Purchases of property and equipment", -23548]},
            {"component":["Purchases of marketable securities", -100315]},
            {"component":["Maturities and sales of marketable securities", 97825]},
            {"component":["Purchases of non-marketable investments", -1932]},
            {"component":["Maturities and sales of non-marketable investments", 405]},
            {"component":["Acquisitions, net of cash acquired, and purchases of intangible assets", -2515]},
            {"component":["Other investing activities", 589]}
        ],
        "total_investing_cash_flows": -29491, 
        "financing_cash_flows": [
            {"component":["Net payments related to stock-based award activities", -4765]},
            {"component":["Repurchases of capital stock", -18396]},
            {"component":["Proceeds from issuance of debt", 317]},
            {"component":["Repayments of debt", -585]},
            {"component":["Proceeds from sale of interest in consolidated entities", 220]}
        ],
        "total_financing_cash_flows": -23209,
        "other_cash_effects": -23,
        "change_in_cash": 1797,
        "beginning_cash_balance": 16701,
        "ending_cash_balance": 18498
        }
    },
    "mda": [
        {"paragraph": "The following trends have contributed to the results of our consolidated operations, and we anticipate that they will continue to impact our future results:"},
        {"paragraph": "Users' behaviors and advertising continue to shift online as the digital economy evolves. The continuing shift from an offline to online world has contributed to the growth of our business since inception, resulting in increasing revenues, and we expect that this online shift will continue to benefit our business."},
        {"paragraph": "As online advertising evolves, we continue to expand our product offerings which may impact our monetization. As interactions between users and advertisers change and as online user behavior evolves, we continue to expand and evolve our product offerings to serve their changing needs. Over time, we expect our monetization trends to fluctuate. For example, we have seen an increase in YouTube engagement ads, which monetize at a lower rate than traditional desktop search ads. Additionally, we continue to see a shift to programmatic buying which presents opportunities for advertisers to connect with the right user, in the right moment, in the right context. Programmatic buying has a different monetization profile than traditional advertising buying on Google properties."},
        {"paragraph": "Users are increasingly using multiple devices and modalities to access our products and services, and our advertising revenues are increasingly coming from mobile and other new formats. Our users are accessing the Internet via multiple devices and modalities and want to feel connected no matter where they are or what they are doing. We seek to expand our products and services to stay in front of this shift in order to maintain and grow our business.We generate our advertising revenues increasingly from mobile and newer advertising formats, and the margins from the advertising revenues from these sources have generally been lower than those from traditional desktop search. Accordingly, we expect TAC paid to our distribution partners to increase due to changes in device mix between mobile, desktop, and tablet, partner mix, partner agreement terms, and the percentage of queries channeled through paid access points. We expect these trends to continue to put pressure on our overall margins."},
        {"paragraph": "As users in developing economies increasingly come online, our revenues from international markets continue to increase and movements in foreign exchange rates impact such revenues The shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S., including in emerging markets, and we continue to develop localized versions of our products and relevant advertising programs useful to our users in these markets. This has led to a trend of increased revenues from international markets over time and we expect that our results will continue to be impacted by our performance in these markets, particularly as low-cost mobile devices become more available. Our international revenues represent a significant portion of our revenues and are subject to fluctuations in foreign currency exchange rates relative to the U.S. dollar. While we have a foreign exchange risk management program designed to reduce our exposure to these fluctuations, this program does not fully offset their effect on our revenues and earnings."},
        {"paragraph": "The portion of our revenues that we derive from non-advertising revenues is increasing and may impact margins. Non-advertising revenues have grown over time. We expect this trend to continue as we focus on expanding our offerings to our users through products and services like Google Cloud, Google Play, hardware products, and YouTube subscriptions. Across these initiatives, we currently derive non-advertising revenues primarily from sales of apps, in-app purchases, digital content products, and hardware; and licensing and service fees including fees received for Google Cloud offerings. The margins on these non-advertising businesses vary significantly and may be lower than the margins on our advertising business. A number of our Other Bets initiatives are in their initial development stages, and as such, the sources of revenues from these businesses could change over time and the revenues could be volatile."},
        {"paragraph": "As we continue to look for new ways to serve our users and expand our businesses, we will invest heavily in R&D and our capital expenditures will continue to fluctuate. We continue to make significant research and development (R&D) investments in areas of strategic focus such as advertising, cloud, machine learning, and search, as well as in new products and services. The amount of our capital expenditures has fluctuated and may continue to fluctuate in the long term as we invest heavily in our systems, data centers, real estate and facilities, and information technology infrastructure. In addition, acquisitions remain an important part of our strategy and use of capital, and we expect to continue to spend cash on acquisitions and other investments. These acquisitions generally enhance the breadth and depth of our offerings, as well as expand our expertise in engineering and other functional areas."},
        {"paragraph": "Our employees are critical to our success and we expect to continue investing in them. Our employees are among our best assets and are critical for our continued success. Their energy and talent drive Alphabet and create our success. We expect to continue hiring talented employees around the globe and to provide competitive compensation programs to our employees."}
    ]
}