{
    "entity_name": "Cheniere Energy Inc",
    "ticker": "LNG",
    "period": "12_31_2017",
    "scale": 1000000,
    "shares": [
        {"component":["Outstanding Shares", 254084493]},
        {"component":["Basic EPS", 2.53]},
        {"component":["Diluted EPS", 2.51]},
        {"component":["Weighted Average Shares Outstanding", 256.2]},
        {"component":["Diluted Weighted Average Shares Outstanding", 258.1]}
    ],
    "balance_sheet": {
        "assets": {
            "current_assets": [
                {"component":["Cash and Cash Equivalents", 2474]},
                {"component":["Restricted Cash", 520]},
                {"component":["Accounts and other receivables", 491]},
                {"component":["Inventory", 312]},
                {"component":["Derivative Assets", 323]},
                {"component":["Other Current Assets", 92]}
            ],
            "total_current_assets": 4212,
            "non_current_assets": [
                {"component":["Property Plant and Equipment, Net", 29673]},
                {"component":["Non-current Derivative Assets", 174]},
                {"component":["Goodwill", 77]},
                {"component":["Deferred Tax Assets", 529]},
                {"component":["Operating Lease Assets", 439]},
                {"component":["Other non-current assets, net", 388]}
            ],
            "total_non_current_assets": 31280,
            "total_assets": 35492
        },
        "liabilities": {
            "current_liabilities": [
                {"component":["Accounts Payable", 66]},
                {"component":["Accrued Liabilities", 1281]},
                {"component":["Current Debt", 0]},
                {"component":["Deferred Revenue", 161]},
                {"component":["Derivative Liabilities", 117]},
                {"component":["Current Operating Lease Liabilities", 236]},
                {"component":["Other Current Liabilites", 13]}
            ],
            "total_current_liabilities": 1874,
            "non_current_liabilities": [
                {"component":["Long-term debt, net", 30774]},
                {"component":["Non-current operating lease liabilities", 189]},
                {"component":["Non-current finance lease liabilities", 58]},
                {"component":["Non-current derivative liabilities", 151]},
                {"component":["Other non-current liabilities", 11]}
            ],
            "total_non_current_liabilities": 31189,
            "total_liabilities": 33057
        },
        "equity": {
            "stock": [
                {"component": ["Common Stock", 1]},
                {"component": ["Treasury Stock", -674]},
                {"component": ["Additional Paid In Capital", 4167]},
                {"component": ["Retained Earnings", -3508]}
            ],
            "preferred_stock": [{"component":["Preferred Stock", 0]}],
            "minority_interest": 2449,
            "total_equity": 2435
        }
    },
    "income_statement": {
        "revenue": [
            { "component": ["LNG Revenues", 5317] },
            { "component": ["Regasification Revenues", 260] },
            { "component": ["Other Revenues", 24] }
        ],
        "total_revenue": 5601,
        "operating_expenses": [
            { "component": ["Cost of Sales", 3120] },
            { "component": ["Operating and Maintenance Expense", 446] },
            { "component": ["Development Expense", 10] },
            { "component": ["Selling, General Administrative_expense", 256] },
            { "component": ["Depreciation and Amortization Expense", 356] },
            { "component": ["Restructuring Expense", 6] },
            { "component": ["Impairment Expense and Loss on Disposal of Assets", 19] }
        ],
        "total_operating_costs": -4213,
        "operating_income": 1388,
        "other_income_expense": [
            { "component": ["Interest Expense, net of capitalized interest", -747] },
            { "component": ["Loss on modification or extinguishment of debt", -100] },
            { "component": ["Derivative Gain (Loss), net", 7] },
            { "component": ["Other income (expense)", 18] }
        ],
        "total_other_income_expense": -822,
        "pretax_income": 566,
        "total_tax_provision": -3,
        "net_income_attributable_noncontrolling_interest": -956,
        "net_income": 563,
        "net_income_post_minority_interest": -393
    },
    "cash_flow_statement": {
        "operating_cash_flows": {
            "reconciliation_adjustments": [
                { "component": ["Depreciation and Amortization Expense", 794] },
                { "component": ["Share-based compensation expense", 131] },
                { "component": ["Non-cash interest expense", 143] },
                { "component": ["Amortization of debt issuance costs, deferred commitment fees, premium and discount", 103] },
                { "component": ["Non-cash operating lease costs", 350] },
                { "component": ["Loss on modification or extinguishment of debt", 55] },
                { "component": ["Total losses (gains) on derivatives, net", -400] },
                { "component": ["Net cash provided by (used for) settlement of derivative instruments", 138] },
                { "component": ["Impairment expense and loss on disposal of assets", 23] },
                { "component": ["Impairment or loss on equity method investments", 88] },
                { "component": ["Deferred Taxes", -521] },
                { "component": ["Other", 0] }
            ],
            "total_reconciliation_adjustments": 904,
            "working_capital_changes": [
                { "component": ["Accounts and other receivables", 1] },
                { "component": ["Inventory", 11] },
                { "component": ["Other current assets", -18] },
                { "component": ["Accounts payable and accrued liabilities", 52] },
                { "component": ["Deferred revenue", 22] },
                { "component": ["Operating lease liabilities", -366] },
                { "component": ["Finance lease liabilities", 1] },
                { "component": ["Other, net", -6] }
            ],
            "total_change_in_working_capital": -303
        },
        "total_operating_cash_flows": 1833,
        "investing_cash_flows": [
            { "component": ["Property, plant and equipment, net", -3056] },
            { "component": ["Investment in equity method investment", -105] },
            { "component": ["Other", -2] }
        ],
        "total_investing_cash_flows": -3163,
        "financing_cash_flows": [
            { "component": ["Proceeds from the issuance of debt", 6434] },
            { "component": ["Repayments of Debt", -4346] },
            { "component": ["Debt issuance and deferred financing costs", -51] },
            { "component": ["Debt extinguishment costs", -15] },
            { "component": ["Distributions and dividends to non-controlling interest", -590] },
            { "component": ["Payments related to tax withholdings for share-based compensation", -19] },
            { "component": ["Repurchase of common stock", -249] },
            { "component": ["Other", 4] }
        ],
        "total_financing_cash_flows": 1168,
        "change_in_cash": -162,
        "beginning_cash_balance": 3156,
        "ending_cash_balance": 2994
    },
    "mda": [
        {"paragraph": "Cheniere, a Delaware corporation, is a Houston-based energy company primarily engaged in LNG-related businesses. Our vision is to provide clean, secure and affordable energy to the world, while responsibly delivering a reliable, competitive and integrated source of LNG, in a safe and rewarding work environment. We own and operate the Sabine Pass LNG terminal in Louisiana through our ownership interest in and management agreements with Cheniere Partners, which is a publicly traded limited partnership that we created in 2007. We own 100% of the general partner interest in Cheniere Partners and 82.7% of Cheniere Holdings, which is a publicly traded limited liability company formed in 2013 that owns a 48.6% limited partner interest in Cheniere Partners. We are currently developing and constructing two natural gas liquefaction and export facilities. The liquefaction of natural gas into LNG allows it to be shipped economically from areas of the world where natural gas is abundant and inexpensive to produce to other areas where natural gas demand and infrastructure exist to economically justify the use of LNG."},
        {"paragraph": "The Sabine Pass LNG terminal is located in Cameron Parish, Louisiana, on the Sabine-Neches Waterway less than four miles from the Gulf Coast. Cheniere Partners is developing, constructing and operating natural gas liquefaction facilities (the “SPL Project”) at the Sabine Pass LNG terminal adjacent to the existing regasification facilities through a wholly owned subsidiary, SPL. Cheniere Partners plans to construct up to six Trains, which are in various stages of development, construction and operations. Trains 1 through 4 are operational, Train 5 is under construction and Train 6 is being commercialized and has all necessary regulatory approvals in place. Each Train is expected to have a nominal production capacity, which is prior to adjusting for planned maintenance, production reliability and potential overdesign, of approximately 4.5 mtpa of LNG and an adjusted nominal production capacity of approximately 4.3 to 4.6 mtpa of LNG. The Sabine Pass LNG terminal has operational regasification facilities owned by Cheniere Partners’ wholly owned subsidiary, SPLNG, that include pre-existing infrastructure of five LNG storage tanks with aggregate capacity of approximately 16.9 Bcfe, two marine berths that can each accommodate vessels with nominal capacity of up to 266,000 cubic meters and vaporizers with regasification capacity of approximately 4.0 Bcf/d. Cheniere Partners also owns a 94-mile pipeline that interconnects the Sabine Pass LNG terminal with a number of large interstate pipelines (the “Creole Trail Pipeline”) through a wholly owned subsidiary, CTPL."},
        {"paragraph": "We are developing and constructing a second natural gas liquefaction and export facility at the Corpus Christi LNG terminal, which is on nearly 2,000 acres of land that we own or control near Corpus Christi, Texas, and a pipeline facility (collectively, the “CCL Project”) through wholly owned subsidiaries CCL and CCP, respectively. The CCL Project is being developed for up to three Trains, with expected aggregate nominal production capacity, which is prior to adjusting for planned maintenance, production reliability and potential overdesign, of approximately 13.5 mtpa of LNG, three LNG storage tanks with aggregate capacity of approximately 10.1 Bcfe and two marine berths that can each accommodate vessels with nominal capacity of up to 266,000 cubic meters. The CCL Project is being developed in stages. The first stage (“Stage 1”) includes Trains 1 and 2, two LNG storage tanks, one complete marine berth and a second partial berth and all of the CCL Project’s necessary infrastructure facilities. The second stage (“Stage 2”) includes Train 3, one LNG storage tank and the completion of the second partial berth. The CCL Project also includes a 23-mile natural gas supply pipeline that will interconnect the Corpus Christi LNG terminal with several interstate and intrastate natural gas pipelines (the “Corpus Christi Pipeline”). Stage 1 and the Corpus Christi Pipeline are currently under construction, and Train 3 is being commercialized and has all necessary regulatory approvals in place. The construction of the Corpus Christi Pipeline is nearing completion."},
        {"paragraph": "Additionally, we are developing an expansion of the Corpus Christi LNG terminal adjacent to the CCL Project (the “Corpus Christi Expansion Project”) and recently began the process of amending our regulatory filings with FERC to incorporate a project design change, from two Trains with an expected aggregate nominal production capacity of approximately 9.0 mtpa to up to seven midscale Trains with an expected aggregate nominal production capacity of approximately 9.5 mtpa. We remain focused on expansion of our existing sites by leveraging existing infrastructure. We are also in various stages of developing other projects, including infrastructure projects in support of natural gas supply and LNG demand, which, among other things, will require acceptable commercial and financing arrangements before we make a final investment decision (“FID”). We have made an equity investment of $55 million in Midship Pipeline Company, LLC (“Midship Pipeline”), which is developing a pipeline with expected capacity of up to 1.44 million Dekatherms per day that will connect new gas production in the Anadarko Basin to Gulf Coast markets, including markets serving the SPL Project and the CCL Project."}
    ]
}