[ 
    { "label": "STEP 1"
    , "description": "This is a timeline of all of the publicly reported academic sexual misconduct cases in the US. There is a total of 1030 reported cases from 1979 to 2020, as of April 1, 2020. Only cases with known outcomes are shown here (all cases in 2020, and a portion of cases in 2019 are still unresolved). Note that cases of sexual misconduct are likely much higher than what is officially reported to the institutions of origin. Reports of sexual harassment have steadily increased throughout the decades, with initial cases in the late 1970s. This is perhaps largely due to the passage of laws and public of court cases that set the stage for sexual harassment cases to come. "
    },
    { "label": "STEP 2"
    , "description": "Under the Educational Amendments of 1972, the federal civil rights law Title IX was passed, which prohibited discrimination on the basis of sex in educational institutions receiving federal aid. In a landmark case in 1980 between Yale University and five of its students (Ronnie Alexander, Margery Reifler, Pamela Price, Lisa E Stone and Ann Olivarius) in 1980 (Alexander v Yale), Title IX was used for the first time in charges of sexual harassment against an educational institution. While the plaintiffs did not win the case, they succeeded in having Yale set in place a grievance procedure for students in the event that they experienced sexual harassment. It also established that sexual harassment could be considered sex discrimination under Title IX and was illegal."
    },
    { "label": "STEP 3"
    , "description": "In 1991, Anita Hill testified against then Supreme Court nominee Clarence Thomas during his confirmation hearings, accusing him of sexual harassment while he was her supervisor at the Department of Education and the Equal Employment Opportunity Commission. In that year alone, the number of sexual harassment cases reported to the EEOC increased by 58%, and has steadily increased since."
    },
    { "label": "STEP 4"
    , "description": "In 2017, actress Alyssa Milano used the hashtag #MeToo, originally coined by civil rights activist Tarana Burke in 2006, on Twitter to highlight sexual abuse by Hollywood titan Harvey Weinstein. With this, she called out for fellow survivors of sexual misconduct to step forward and join in on highlighting similar experiences. #MeToo subsequently went viral, as thousands of women publicly detailed their accounts. This triggered a massive increase in the number of reported sexual misconduct cases in the academic world as well."
    },
    { "label": "STEP 5"
    , "description": "Out of all cases, 332 of them originate from STEM fields. This is around a third of total cases. Following overall trends, reports of sexual misconduct cases have skyrocketed since 2017, when the #MeToo movement made waves throughout all of society. Many prominent scientists were exposed between 2017 and 2019 in highly publicized investigative news reports that reached beyond the immediate scientific community."
    }
]