[{
    "year": 1723,
    "content": [{
      "state": "United Kingdom",
      "law": "9 George 1 c.22: <span class=\"highlight\">The Black Act</span> - An act for the more effectual punishing <span class=\"highlight\">wicked and evil-disposed</span> persons going <span class=\"highlight\">armed in disguise</span>, and <span class=\"highlight\">doing injuries and violences</span> to the persons and properties of his Majesty’s subjects, and for the more speedy bringing the offenders to justice.",
      "context": "In response to a series of <span class=\"highlight\">raids by</span> two groups of poachers, known as <span class=\"highlight\">the Blacks</span>"
    }],
    "iso":["GBR"]
  },
  {
    "year": 1845,
    "content": [{
      "state": "United States",
      "law": "New York Penal Law § 240.45(4) - Being masked or in any manner disguised by <span class=\"highlight\">unusual or unnatural attire or facial alteration</span>, loiters, remains or congregates in a public place with other persons so masked or disguised, or knowingly permits or aids persons so <span class=\"highlight\">masked or disguised</span> to congregate in a public place; except that such conduct is not unlawful when it occurs in connection with a masquerade party or like entertainment if, when such entertainment is held in a city which has promulgated regulations in connection with such affairs, permission is first obtained from the police or other appropriate authorities.",
      "context": "Tenant farmers used disguises (dressing up like Indians) to attack law enforcement officials, apparently, to provide for public safety after <span class=\"highlight\">disputes between landlords and tenants</span>."
    }],
    "iso":["USA"]
  },
  {
    "year": 1975,
    "content": [{
      "state": "Italy",
      "law": "A law strictly forbids wearing of <span class=\"highlight\">any attire</span> that could <span class=\"highlight\">hide the face</span> of a person. Penalties (fines and imprisonment) are provided for such behaviour. The original purpose of the anti-mask law was to prevent crime or terrorism.",
      "context": "There are disagreements whether one's religion is a <span class=\"highlight\">justified cause</span>."
    }],
    "iso":["ITA"]
  },
  {
    "year": 1985,
    "content": [{
      "state": "Germany",
      "law": "According to section 17a (2) of the VersammlG, which was adopted by most of the federal states on this point, <span class=\"highlight\">disguise at meetings</span> is a criminal offense and, according to section 27 (2) and section 29 (2) of the VersammlG, imprisonment of up to one year or punished with a fine. The <span class=\"highlight\">carrying of masking utensils</span> is punished in the VersG as an administrative offense with a maximum of 511.29 euros. ( § 29 Paragraph 1 No. 1 a VersG)",
      "context": "The votes of the conservative-liberal coalition under<span class=\"highlight\"> Helmut Kohl</span> in the Bundestag."
    }],
    "iso":["DEU"]
  },
  {
    "year": 1995,
    "content": [{
      "state": "Norway",
      "law": "According to § 11, part 5 of the police statute (politiloven) from 1995, it is prohibited to be <span class=\"highlight\"> masked during an event</span> taking place <span class=\"highlight\"> in public</span>. Exempted from the prohibition are participants in theatre, masquerade or similar. In accordance with § 30 of the same law; violation is punishable by a fine or up to three months imprisonment.",
      "context": ""
    }],
    "iso":["NOR"]
  },
  {
    "year": 2000,
    "content": [{
      "state": "Denmark",
      "law": "The Danish penal code (Straffeloven) § 134 b: Anyone who, in connection with meetings, gatherings, marches or the like in <span class=\"highlight\">public places</span>, has his or her span class=\"highlight\">face covered in whole or in part</span> with a hood, mask, paint or the like in a manner suitable to span class=\"highlight\">prevent identification</span>, is punished with fine, bond or imprisonment until 6 months.",
      "context": ""
    }],
    "iso":["DNK"]
  },
  {
    "year": 2002,
    "content": [{
      "state": "Austria",
      "law": "On demonstrations under § 9 of Versammlungsgesetz: The authority shall prevent people from participating in an assembly if they <span class=\"highlight\">disguise their face</span> or at least bear items which have the purpose to disguise one’s face. Violation of the ban need not be prosecuted if the mask does not <span class=\"highlight\">threaten public order and security</span>. Violation of the ban entails, according to § 19a.b of the Law, imprisonment up to six months, repeated offenses one year or a fine.",
      "context": ""
    }],
    "iso":["AUT"]
  },
  {
    "year": 2005,
    "content": [{
      "state": "Sweden",
      "law": "Ordningslagen: Act (2005: 900) on the prohibition of masking in certain cases: Anyone who takes part <span class=\"highlight\">in a public gathering</span>, whether or not in accordance with the Ordinance Act (1993: 1617), may not <span class=\"highlight\">cover the face in whole or in part</span> in a way that <span class=\"highlight\">makes identification difficult</span> if at the meeting there is a <span class=\"highlight\">disturbance of the general order</span> or an immediate danger of such a disturbance.",
      "context": ""
    }],
    "iso":["SWE"]
  },
  {
    "year": 2010,
    "content": [{
      "state": "France",
      "law": "ASSEMBLÉE NATIONALE n° 524 Article 1: No one may, <span class=\"highlight\">in public space</span>, wear <span class=\"highlight\">an outfit intended to conceal his face</span>. <span class=\"highlight\">Exceptions</span>: required or permitted by the laws or regulations, justified by reasons of health or professional reasons, or as part of sports, parties or artistic or traditional events.",
      "context": "The French Parliament began an initial inquiry on the issue shortly after President Nicolas Sarkozy stated in June 2009 that religious face veils were not welcome within France. <span class=\"highlight\">Upheld</span> by the European Court of Human Rights (ECHR) in 2014."
    }],
    "iso":["FRA"]
  },
  {
    "year": 2011,
    "content": [{
      "state": "Belgium",
      "law": "A Belgian law adopted in June 2011 prohibits appearing in public \"<span class=\"highlight\">with a face masked or hidden</span>, in whole or in part, in such a way as to be <span class=\"highlight\">unidentifiable</span>\". Violations can result in fines and up to seven days in jail. ",
      "context": "On 11 July 2017 the ban in Belgium was <span class=\"highlight\">upheld</span> by the European Court of Human Rights (ECHR) after having been challenged bytwo Muslim women who claimed their rights had been infringed"
    }],
    "iso":["BEL"]
  },
  {
    "year": 2012,
    "content": [{
      "state": "Russia",
      "law": "FEDERAL LAW No. 65-FZ OF JUNE 2004: 4. Participants in public events may not: 1) <span class=\"highlight\">conceal their faces</span>, including through the use of masks, means of disguise or other items specially intended to make them more <span class=\"highlight\">difficult to identify</span>;",
      "context": ""
    }],
    "iso":["RUS"]
  },
  {
    "year": 2013,
    "content": [{
      "state": "Canada<br><br><br><br><br>Spain",
      "law": "The Preventing Persons from <span class=\"highlight\">Concealing Their Identity</span> during <span class=\"highlight\">Riots and Unlawful Assemblies</span> Act (Bill C-309): banning the wearing of masks during a riot or unlawful assembly, carrying a maximum ten-year prison sentence with a conviction of the offence. <br><span style=\"color:#A6330A\">________________________________________________________</span><br><br>According to the November 2013 Citizens' Security Law (Ley mordaza), demonstration <span class=\"highlight\">protesters</span> who <span class=\"highlight\">cover their faces</span> may be fined up to €30,000.",
      "context": ""
    }, {
      "state": "Spain",
      "law": "According to the November 2013 Citizens' Security Law (Ley mordaza), demonstration <span class=\"highlight\">protesters</span> who <span class=\"highlight\">cover their faces</span> may be fined up to €30,000.",
      "context": ""
    }],
    "iso":["CAN","ESP"]
  },
  {
    "year": 2014,
    "content": [{
      "state": "Ukraine",
      "law": "LAW OF UKRAINE No.721-VII Article 185: Participation in a meeting, rally, street march, demonstration, other <span class=\"highlight\">mass event</span> in a mask, helmet, or using other means or methods of masking in order to <span class=\"highlight\">avoid the identification</span> of the person <span class=\"highlight\">or the presence</span> of the person ... entail a fine of one hundred fifty to two hundred and fifty tax-free minimum incomes, or an administrative arrest of up to fifteen days.",
      "context": "Several days after <span class=\"highlight\">Berkut riot police clashed with Euromaidan protesters</span>, Verkhovna Rada enacted law 721-VII. Became invalid on the basis of Law No. 732-VII of January 28, 2014"
    }],
    "iso":["UKR"]
  },
  {
    "year": 2017,
    "content": [{
      "state": "Austria",
      "law": "Parliament approved new legislation on 16 May, which stipulates that people who wear <span class=\"highlight\">clothing that covers their faces</span>, such as burqas, niqabs, full face helmets or scarves (motorcyclists) etc. in places like universities, public transportation or courthouses will face fines of 150 euros (about $167).",
      "context": " Recent <span class=\"highlight\">terrorist attacks</span> in France, Belgium, Sweden and elsewhere, and <span class=\"highlight\">fears</span> that <span class=\"highlight\">extremists</span> are entering <span class=\"highlight\">Europe</span> by posing as <span class=\"highlight\">refugees</span>."
    }],
    "iso":["AUT"]
  },
  {
    "year": 2018,
    "content": [{
      "state": "Netherlands",
      "law": "Act 34,349: Establishing a partial ban on the wearing of face-covering clothing in <span class=\"highlight\">education, public transport, government buildings and care</span> (Partial Ban on Face-Covering Clothing Act)",
      "context": ""
    }],
    "iso":["NLD"]
  },
  {
    "year": 2019,
    "content": [{
      "state": "Hong Kong, SAR",
      "law": "Cap. 241K Prohibition on Face Covering Regulation: Anyone who wears a mask at a <span class=\"highlight\">lawful rally or march</span>, <span class=\"highlight\">unlawful or unauthorised assembly</span>, or during a <span class=\"highlight\">riot</span> could be sentenced to up to a year in jail and a fine of HK$25,000. ",
      "context": ""
    }],
    "iso":["HKG"]
  }
]
